lst = list(map(int, input().split()))

dict = {1:4, 2:4, 3:4, 4:5.7, 5:7,
        6:7.3, 7:7.5, 8:10.2, 9:4.9, 10:6.6,
        11:4, 12:6.2, 13:4, 14:5.3, 15:7,
        16:7.2, 17:6.4, 18:6.8, 19:7.1, 20:7.3,
        21:7.7, 22:8.8, 23:7.2, 24:9.4, 25:12,
        26:4.5, 27:6.5, 28:6.7, 29:6.9, 30:6.9,
        31:7.1, 32:7.2, 33:7.4, 34:8.2, 35:11}


sum = 0
for i in lst:
    sum += dict[i]
sum = int(sum)

#틀려도 되는 문제
incorrect = [6, 7, 8, 16, 20, 21, 22, 24, 25, 33, 34, 35]
lst2 = list(set(lst) - set(incorrect))

print(f'오답 분석하렴: {lst2}')         #틀리면 안 되는 문제들(오답 분석)
print(sum)                           #틀린 점수
print(f'너의 최종 점수는: {240 - sum}점')      #최종 점수